const faq = [{
  question: '为什么一到选修课开放时间就进不去？',
  answer: '教务处服务器被你们挤爆了，学校也不肯升级服务器，我也没办法，《我的衡师》也是请求教务处服务器的，教务处官网进不去，《我的衡师》也就不能抢课'
}, {
  question: '我的某门课程成绩为什么还没出？',
  answer: '查成绩功能从教务处同步，如果你的同学都有，就你没有的话，建议咨询相关老师'
}, {
  question: '为什么我不能充值校园卡？',
  answer: '从2020级新生（包括研究生）开始，就无法使用校园卡APP接口进行充值了（以后可能会进行支持）'
}, {
  question: '为什么校园卡充值后一直未到账？',
  answer: '因银行隐私安全限制，校园卡无法获取你的银行卡余额，只能将充值订单提交至银行，提交成功即认为充值成功，但若两分钟内未到账则充值失败，请检查你的银行卡余额是否大于等于你的充值金额'
}, {
  question: '为什么校园卡二维码没有用？',
  answer: '校园卡二维码使用需要特殊的技巧，每个刷卡机上方有个隐藏的摄像头，你可能需要将手机靠近一些才会被它成功识别（这个技巧我也未掌握，但听说有些同学用的很6）'
}, {
  question: '怎么没有XX功能？/我感觉UI/配色不好看！',
  answer: '很抱歉，因为《我的衡师》是我一个人开发的，我也已经毕业，精力实在有限，如果你有什么好的点子或者设计稿，可添加我的微信/QQ：734824565'
}, {
  question: '校园卡怎么换绑银行卡？/校园卡被多扣钱怎么办？/校园卡丢了怎么补卡？',
  answer: '校园卡无法换绑银行卡。被多扣钱、想补卡，建议找学生服务大厅帮忙'
}]

export { faq }
