const logList = [
  {
    date: '2020年3月28日',
    version: 'V1.2.1',
    content: `云函数超时时间改为20秒（20秒已为上限，请尽量在网络流畅时使用）；教务处登录页验证码不再自动清空。`
  },
  {
    date: '2020年3月28日',
    version: 'V1.2.0',
    content: `部分页面优化；云函数超时时间改为10秒；选修课列表百分比保留整数；分享bug修复，所有页面均可转发；百宝箱页功能顺序调整；选修课页选课成功后改为弹窗提示；校园卡登录提示更加友好。`
  },
  {
    date: '2020年3月27日',
    version: 'V1.1.2',
    content: `教务处的报错提示更加友好；”我的“页面细节优化。`
  },
  {
    date: '2020年3月27日',
    version: 'V1.1.0',
    content: '修复查看课程详情时图标没显示的bug；调整百宝箱页面功能顺序；选修课排序改为已选人数从多到少。'
  }
]

export default logList
